USE majdb;

INSERT INTO architecture
(architecture_name, postalcode, address1, address2, address3, address4, latitude, longitude, architect_id)
VALUES
    ("Hikarino kyokai", "5670048", "大阪府", "茨木市", "北春日丘４丁目", "３−５０", 34.818735987609614, 135.53706218634207, 1),
    ("Mizuno kyokai", "0792204", "北海道", "勇払郡", "占冠村中", "トマム", 43.023811, 142.600983, 1),
    ("KHギャラリー芦屋", "6590003", "兵庫県", "芦屋市", "奥池町", "１７−５", 34.774175659890794, 135.28517636932554, 1),
    ("Kidosaki House", "1550033", "東京都", "世田谷区", "代田２丁目", "２−８", 35.65546448466847, 139.6639480942865, 1),   
    ("House in Sri Lanka", "XF64+R4", "スリランカ", "Mirissa", "Polwathumodara", "", 5.962110564619353, 80.45532740104613, 1),
    ("UNESCO Meditation Space", "R8X4+VC", "フランス", "Paris", "7 Pl", "de Fontenoy, 75007", 48.850628650538546, 2.3064347679505786, 1),
    ("ピューリッツァー美術館", "JQR8+36", "アメリカ合衆国", "MO 63108", "St. Louis", "3716 Washington Ave", 38.64030930156856, -90.23441098844329, 1),
    ("sumida museum", "1300014", "東京都", "墨田区", "亀沢２丁目", "７−２", 35.69718518037695, 139.80080023806926, 2),
    ("アンデルセン博物館", "99XR+F8", "デンマーク", "5000 Odense C", "H.C. Andersen Haven 1", "", 55.3988655001832, 10.390745654400991, 2),
    ("角川武蔵野ミュージアム", "3590023", "埼玉県", "所沢市", "東所沢和田３丁目", "31番地3 ところざわサクラタウン", 35.797910824385006, 139.50792091518562, 2),
    ("国立競技場", "1600013", "東京都", "新宿区", "霞ヶ丘町", "１０−１", 35.6782191991154, 139.71461107607112, 2),
    ("Odunpazari Modern Museum", "QG7F+V3", "トルコ", "26020 Odunpazarı/Eskişehir", "Atatürk Blv. No: 37", "Şarkiye", 39.76527818282726, 30.522884476716545, 2),
    ("V&Aダンディー", "F24M+X5", "イギリス", "Dundee DD1 4EZ", "1 Riverside Esplanade", "", 56.4579129336284, -2.9668533386267693, 2),
    ("スイス連邦工科大学ローザンヌ校", "GH98+JP", "スイス", "1015 Lausanne", "Rte Cantonale", "", 46.518981873401124, 6.566543022603514, 2),
    ("nagasaki-pref museum", "8500862", "長崎県", "長崎市", "出島町", "２−１", 32.742686576864386, 129.870360615341, 3),
    ("グレース・ファームズ", "5FWQ+P5", "CT 06840 アメリカ合衆国", "Toledo", "365 Lukes Wood Rd", "２−１", 41.19769757866748, -73.51178550794016, 3),
    ("岐阜県営住宅ハイタウン北方", "5010431", "岐阜県", "本巣郡", "北方町北方", "青桐通り", 35.43456453275112, 136.68364209259687, 3),
    ("金沢21世紀美術館", "9208509", "石川県", "金沢市", "広坂１丁目", "２−１", 36.561630050656206, 136.6585682153433, 3),
    ("トレド美術館 ガラスパビリオン", "8500862", "アメリカ合衆国", "OH 43620", "2445 Monroe St", "", 44.68729732628307, -83.52340003227023, 3)
    ;