INSERT INTO architect 
(architect_name) 
VALUES
    ('安藤忠雄'),
    ('隈研吾'),
    ('妹島和世')

INSERT INTO architecture
(architecture_name, postalcode, address1, address2, address3, address4, latitude, longitude, architect_id)
VALUES
    ("光の教会(日本キリスト教団 茨木春日丘教会)", "5670048", "大阪府", "茨木市", "北春日丘４丁目", "３−５０", 34.818735987609614, 135.53706218634207, )
    ("水の教会", "0792204", "北海道", "勇払郡", "占冠村中", "トマム", 43.023811, 142.600983, )
    ("すみだ北斎美術館", "1300014", "東京都", "墨田区", "亀沢２丁目", "７−２", 35.69718518037695, 139.80080023806926, )
    ("長崎県美術館", "8500862", "長崎県", "長崎市", "出島町", "２−１", 32.742686576864386, 129.870360615341, )